Revit 2024 API
BuiltInFailures.SteelElementFailures Class
 Failures about steel elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class SteelElementFailures
Visual Basic
Public NotInheritable Class SteelElementFailures
Visual C++
public ref class SteelElementFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures
See Also
BuiltInFailures.SteelElementFailures Members
Autodesk.Revit.DB Namespace